bulicp/OBD2-STM32H750/Core/Src/main.c
  /*Configure GPIO pin : VSYNC_FREQ_Pin */
  GPIO_InitStruct.Pin = VSYNC_FREQ_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(VSYNC_FREQ_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_BL_CTRL_Pin */
  GPIO_InitStruct.Pin = LCD_BL_CTRL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_RESET_Pin */
  GPIO_InitStruct.Pin = LCD_RESET_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_RESET_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : MCU_ACTIVE_Pin */
  GPIO_InitStruct.Pin = MCU_ACTIVE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(MCU_ACTIVE_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

void OBD2GetMsgTask(void *argument)
{
  CAN_OBD2_MSGQUEUE_OBJ_t queue_data;
  osStatus_t status = osOK;
  OBDQueueElement_t OBD2Data;

  /* Infinite loop */
  for(;;)
  {
	  status = osMessageQueueGet(mid_OBD2MsgQueue, &queue_data, NULL, 0U);
	  if (status == osOK){
		  pid = queue_data.pid;

		  switch (pid){
		  // ************************************************************************
		  // ROW 1:
		  case OBD2_PID_VEHICLE_SPEED:
			ui32value = OBD2DecodeVehicleSpeed(queue_data.OBDData);
			OBD2Data.pid = OBD2_PID_VEHICLE_SPEED;
			OBD2Data.uwData = ui32value;
			break;
		  case OBD2_PID_ENGINE_SPEED:
		  	ui32value = OBD2DecodeEngineSpeed(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_ENGINE_SPEED;
		  	OBD2Data.uwData = ui32value;
		  	break;
		  case OBD2_PID_ENGINE_LOAD:
		  	fvalue = OBD2DecodeEngineLoad(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_ENGINE_LOAD;
		  	OBD2Data.fData = fvalue;
		  	break;

		  case OBD2_PID_ENGINE_COOLANT_TEMP:
			ui32value = OBD2DecodeEngineCoolantTemp(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_ENGINE_COOLANT_TEMP;
		  	OBD2Data.uwData = ui32value;
		  	break;
		  case OBD2_PID_INTAKE_AIR_TEMP:
		    ui32value = OBD2DecodeIntakeAirTemp(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_INTAKE_AIR_TEMP;
		  	OBD2Data.uwData = ui32value;
		  	break;
		  case OBD2_PID_AMBIENT_AIR_TEMP:
		  	ui32value = OBD2DecodeIntakeAirTemp(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_AMBIENT_AIR_TEMP;
		  	OBD2Data.uwData = ui32value;
		  	break;

		  case OBD2_PID_MAF_FLOW_RATE:
			fvalue = OBD2DecodeMAFRate(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_MAF_FLOW_RATE;
		  	OBD2Data.fData = fvalue;
		  	break;
		  case OBD2_PID_INTAKE_MANIFOLD_PRESSURE:
		  	ui32value = OBD2DecodeManifoldPressure(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_INTAKE_MANIFOLD_PRESSURE;
		  	OBD2Data.uwData = ui32value;
		  	break;
		  case OBD2_PID_FUEL_PRESSURE:
		  	ui32value = OBD2DecodeFuelPressure(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_FUEL_PRESSURE;
		  	OBD2Data.uwData = ui32value;
		  	break;

		  case OBD2_PID_ABS_CATALYST_TEMP:
			fvalue = OBD2DecodeCatalystTemperature(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_ABS_CATALYST_TEMP;
		  	OBD2Data.fData = fvalue;
		  	break;
		  case OBD2_PID_ABS_BARO_PRESSURE:
		  	ui32value = OBD2DecodeAbsoluteBarometricPressure(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_ABS_BARO_PRESSURE;
		  	OBD2Data.uwData = ui32value;
		  	break;
		  case OBD2_PID_OXY_SENSOR_1:
		  	ui32value = OBD2DecodeOxySensorVoltage(queue_data.OBDData);
		  	fvalue = OBD2DecodeOxySensorTrim(queue_data.OBDData);
		  	OBD2Data.pid = OBD2_PID_OXY_SENSOR_1;
		  	OBD2Data.uwData = ui32value;
		  	OBD2Data.fData = fvalue;
		  	break;

		  default:
			OBD2Data.pid = OBD2_PID_UNSUPPORTED;
			OBD2Data.uwData = 0U;
			break;
		  }

		  // Send the message to the GUI Model:
		  osMessageQueuePut(mid_MODELMsgQueue, &OBD2Data, 0U, 0U);

		  // TODO: poslji OBD2 informacijo preko UARTA:
		  // lahko pretvoriš v string
		  // Msg za transmit ti je v strukturi: OBD2Data:
		  // OBD2Data.pid
		  // OBD2Data.uwData če pid pove, da je data integer
		  // OBD2Data.fData, če PID pove, da je float
		  // HAL_UART_Transmit.....
	  }
  }

}

void OBD2SendQueryTask(void *argument)
{

  /* Infinite loop */
  for(;;)
  {
	  OBD2_SendQuery(0x01, OBD2_PID_VEHICLE_SPEED);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_ENGINE_SPEED);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_ENGINE_LOAD);
	  osDelay(OBD2DELAY);

	  OBD2_SendQuery(0x01, OBD2_PID_ENGINE_SPEED);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_VEHICLE_SPEED);
	  osDelay(OBD2DELAY);

	  OBD2_SendQuery(0x01, OBD2_PID_ENGINE_COOLANT_TEMP);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_INTAKE_AIR_TEMP);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_AMBIENT_AIR_TEMP);  
	  osDelay(OBD2DELAY);

	  OBD2_SendQuery(0x01, OBD2_PID_ENGINE_SPEED);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_VEHICLE_SPEED);
	  osDelay(OBD2DELAY);

	  OBD2_SendQuery(0x01, OBD2_PID_MAF_FLOW_RATE);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_INTAKE_MANIFOLD_PRESSURE);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_FUEL_PRESSURE);
	  osDelay(OBD2DELAY);

	  OBD2_SendQuery(0x01, OBD2_PID_ENGINE_SPEED);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_VEHICLE_SPEED);
	  osDelay(OBD2DELAY);

	  OBD2_SendQuery(0x01, OBD2_PID_ABS_CATALYST_TEMP);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_ABS_BARO_PRESSURE);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_OXY_SENSOR_1);
	  osDelay(OBD2DELAY);

	  OBD2_SendQuery(0x01, OBD2_PID_ENGINE_SPEED);
	  osDelay(OBD2DELAY);
	  OBD2_SendQuery(0x01, OBD2_PID_VEHICLE_SPEED);
	  osDelay(OBD2DELAY);
  }

